# 01. Importing Libraries & Data

In [1]:
#### Import libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
#### Define path
path = r'C:\Users\cemel\Documents\30-12-2023 Instacart Basket Analysis (Achievement 4)'

In [3]:
#### Load the 'customers.csv' file into pandas dataframe
df = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))

## Check the Output

In [4]:
df.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [5]:
df.shape

(206209, 10)

# 02. Wrangling the data so that it follows consistent logic

In [6]:
#### Rename columns
df.rename(columns={'First Name':'first_name','Surnam':'surname','Gender':'gender','STATE':'state','Age':'age','n_dependants':'dependants','fam_status':'family_status'}, inplace=True)

## Check the Output

In [7]:
df.head()

,user_id,first_name,surname,gender,state,age,date_joined,dependants,family_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [8]:
#### Drop the 'date_joined' column since it adds nothing to the analysis
df = df.drop(columns = ['date_joined'])

## Check the Output

In [9]:
df.head()

,user_id,first_name,surname,gender,state,age,dependants,family_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1,married,40374

# 03. Completing the fundamental data quality and consistency checks

## Seeking and Addressing Mixed-type Data

In [10]:
#### Checking for mixed-type data in 'df' dataframe
for col in df.columns:
    weird = (df[[col]].map(type) != df[[col]].iloc[0].map(type)).any(axis=1)
    if len(df[weird]) > 0:
        print(col)

first_name

In [11]:
#### Converting the column to a string type to ensure uniformity and prevent potential issues related to mixed types
df['first_name'] = df['first_name'].astype('str')

## Seeking and Addressing Missing Data

In [12]:
#### Checking for missing values in 'df' columns
df.isnull().sum()

user_id          0
first_name       0
surname          0
gender           0
state            0
age              0
dependants       0
family_status    0
income           0
dtype: int64

In [13]:
#### Creating a copy of the original DataFrame in order to avoid overwriting it
df_no_nans = df.copy()

In [14]:
#### Fill missing values in the 'first_name' column with 'Unknown' in the new DataFrame
df_no_nans['first_name'].fillna('Unknown', inplace=True)

In [15]:
df_no_nans.isnull().sum()

user_id          0
first_name       0
surname          0
gender           0
state            0
age              0
dependants       0
family_status    0
income           0
dtype: int64

## Seeking and Addressing Duplicates

In [16]:
#### Checking for duplicates in 'df' dataframe
duplicates = df[df.duplicated()]

In [17]:
duplicates

Empty DataFrame
Columns: [user_id, first_name, surname, gender, state, age, dependants, family_status, income]
Index: []

## Comments: There appear to be no duplicates in the 'df' dataframe.`

# 04. Combine customer data with the rest of the prepared Instacart data

In [18]:
#### Specifying the path to Instacart data pkl file
pickle_file_path = os.path.join(path, '02 Data', 'Prepared Data', 'ords_prods_merge_aggregated.pkl')

In [19]:
#### Load the pickle file into Pandas DataFrame
df_agg = pd.read_pickle(pickle_file_path)

## Check the Output

In [20]:
df_agg.head()

,Unnamed: 0_x,product_id,product_name,aisle_id,department_id,prices,Unnamed: 0.1,Unnamed: 0_y,order_id,user_id,...,price_range_loc,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,mean_product_price,spender_flag,mean_order_frequency,order_frequency_flag
0,0,1,Chocolate Sandwich Cookies,61,19,5.8,1987,1987,3139998,138,...,Mid-range product,Regularly busy,Regularly busy,Most orders,32,Regular customer,6.935811,Low_spender,8.0,Frequent Customer
1,0,1,Chocolate Sandwich Cookies,61,19,5.8,1989,1989,1977647,138,...,Mid-range product,Regularly busy,Regularly busy,Average orders,32,Regular customer,6.935811,Low_spender,8.0,Frequent Customer
2,0,1,Chocolate Sandwich Cookies,61,19,5.8,11433,11433,389851,709,...,Mid-range product,Busiest day,Busiest days,Average orders,5,New customer,7.930208,Low_spender,8.0,Frequent Customer
3,0,1,Chocolate Sandwich Cookies,61,19,5.8,12198,12198,652770,764,...,Mid-range product,Regularly busy,Slowest days,Most orders,3,New customer,4.972414,Low_spender,9.0,Frequent Customer
4,0,1,Chocolate Sandwich Cookies,61,19,5.8,12200,12200,1813452,764,...,Mid-range product,Least busy,Slowest days,Average orders,3,New customer,4.972414,Low_spender,9.0,Frequent Customer

In [21]:
df_agg.shape

(32404859, 27)

In [22]:
df_agg.dtypes

Unnamed: 0_x                 int64
product_id                   int64
product_name                object
aisle_id                     int64
department_id                int64
prices                     float64
Unnamed: 0.1                 int64
Unnamed: 0_y                 int64
order_id                     int64
user_id                      int64
order_number                 int64
orders_day_of_week           int64
time_of_day                  int64
days_since_prior_order     float64
add_to_cart_order            int64
reordered                    int64
_merge                    category
price_range_loc             object
busiest_day                 object
busiest_days                object
busiest_period_of_day       object
max_order                    int64
loyalty_flag                object
mean_product_price         float64
spender_flag                object
mean_order_frequency       float64
order_frequency_flag        object
dtype: object

In [23]:
#### List of columns to drop to increase merge efficiency
columns_to_drop = ['_merge', 'Unnamed: 0_x', 'Unnamed: 0.1', 'Unnamed: 0_y']

In [24]:
#### Drop the specified columns
df_agg = df_agg.drop(columns=columns_to_drop)

In [25]:
#### Check dtypes for 'df_no_nans' in order to help thinking through key column
df_no_nans.dtypes

user_id           int64
first_name       object
surname          object
gender           object
state            object
age               int64
dependants        int64
family_status    object
income            int64
dtype: object

## Conversion of dtypes for significant reduction in memory usage required for merge of dataframes.

### Conversions for relevant 'df_agg' columns

In [26]:
#### Convert all 'df_agg_copy' columns to int32 where applicable with the exception of 'reordered' column
int32_columns = ['product_id', 'aisle_id', 'order_id', 'user_id', 'add_to_cart_order']

In [27]:
df_agg[int32_columns] = df_agg[int32_columns].astype('int32')

In [28]:
#### Convert all 'df_agg_copy' columns to int8 where applicable
int8_columns = ['department_id', 'order_number', 'orders_day_of_week', 'time_of_day', 'max_order', 'reordered']

In [29]:
df_agg[int8_columns] = df_agg[int8_columns].astype('int8')

### Conversions for relevant 'df_no_nans' columns

In [30]:
#### Columns to be converted to int32
int32_columns_2 = ['user_id', 'income']
df_no_nans[int32_columns_2] = df_no_nans[int32_columns_2].astype('int32')

In [31]:
#### Columns to be converted to int8
int8_columns_2 = ['age', 'dependants']
df_no_nans[int8_columns_2] = df_no_nans[int8_columns_2].astype('int8')

## Comments: 'user_id' selected as key column for merge of 'df_no_nans' and 'df_agg'. Due to memory demand, merge will be attempted through several steps.

## Ensuring that the 'user_id' column is indexed in both dataframes ('df_agg' and 'df_no_nans')

In [32]:
#### Indexing for 'df_agg'
df_agg.set_index('user_id', inplace=True)

In [33]:
#### Indexing for 'df_no_nans'
df_no_nans.set_index('user_id', inplace=True)

## Using Dask for parallel processing

In [34]:
import dask.dataframe as dd

In [35]:
#### Chunking 'df_agg' for Dask processing
chunk_size = 5000
chunks = [df_agg.iloc[i:i + chunk_size] for i in range(0, len(df_agg), chunk_size)]

In [36]:
#### Convert chunks to Dask Dataframes
dask_chunks = [dd.from_pandas(chunk, npartitions=1) for chunk in chunks]

In [37]:
#### Create Dask DataFrame for 'df_no_nans'
ddf_no_nans = dd.from_pandas(df_no_nans, npartitions=1)

In [38]:
#### Merge Chunks with 'df_no_nans' using Dask
dask_merged_chunks = [dd.merge(chunk, ddf_no_nans, on='user_id', how='inner') for chunk in dask_chunks]

In [39]:
#### Concatenating the Results
ddf_result = dd.concat(dask_merged_chunks)

In [40]:
#### Compute the Final Results
df_result = ddf_result.compute()

## Check the Output

In [41]:
df_result.head()

,product_id,product_name,aisle_id,department_id,prices,order_id,order_number,orders_day_of_week,time_of_day,days_since_prior_order,...,mean_order_frequency,order_frequency_flag,first_name,surname,gender,state,age,dependants,family_status,income
user_id,,,,,,,,,,,,,,,,,,,,,
115,10,Sparkling Orange Juice & Prickly Pear Beverage,115,7,8.4,3278419,9,4,18,4.0,...,10.0,Frequent Customer,Carol,Soto,Female,Idaho,77,3,married,98736
138,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,28,6,11,3.0,...,8.0,Frequent Customer,Charles,Cox,Male,Minnesota,81,1,married,49620
138,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,30,6,17,20.0,...,8.0,Frequent Customer,Charles,Cox,Male,Minnesota,81,1,married,49620
225,9,Light Strawberry Blueberry Yogurt,120,16,7.0,169443,11,4,10,6.0,...,15.0,Regular customer,Elizabeth,Tapia,Female,Montana,76,3,married,69724
295,10,Sparkling Orange Juice & Prickly Pear Beverage,115,7,8.4,2287043,7,4,13,1.0,...,6.0,Frequent Customer,John,Harris,Male,Rhode Island,51,2,married,167566

In [42]:
df_result.shape

(32404859, 30)

# Export the 'df_result' as a pkl file

In [43]:
#### Specify the path and filename
file_path = r'C:\Users\cemel\Documents\30-12-2023 Instacart Basket Analysis (Achievement 4)\02 Data\Prepared Data\ords_prods_agg_pythonviz.pkl'

In [44]:
#### Export DataFrame to pickle file
df_result.to_pickle(file_path)